# Taps
tap 'homebrew/cask-cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'git'
brew 'mas' # Mac App Store manager
brew 'zsh'

# Development
brew 'n'

# Apps
cask 'atom'
cask 'brave-browser'
cask 'dash'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'hyper'
cask 'iterm2'
cask 'rocket'
cask 'safari-technology-preview'
cask 'slack'
cask 'spectacle'
cask 'visual-studio-code'

# Mac App Store
mas '1Password 7', id: 1333542190
mas 'Keynote', id: 409183694
mas 'Jira', id: 1475897096
mas 'Spark - Email App by Readdle', id: 1176895641
mas 'Telegram', id: 747648890
mas 'ToothFairy', id: 1191449274
mas 'Twitter', id: 1482454543
