# Taps
tap 'homebrew/cask-cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'git-lfs'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

# Development
brew 'n'

# Apps
cask 'aerial'
cask 'atom'
cask 'brave-browser'
cask 'caffeine'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'insomnia'
cask 'safari-technology-preview'
cask 'slack'
cask 'visual-studio-code'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas '1Password', id: 1333542190
mas 'Keynote', id: 409183694
mas 'Spark', id: 1176895641